<!--
 	Copyright (c) 2019, 2020 Oracle and/or its affiliates. All rights reserved.
	
	This program and the accompanying materials are made available under the
	terms of the Eclipse Public License v. 2.0, which is available at
	http://www.eclipse.org/legal/epl-2.0.
	
	This Source Code may also be made available under the following Secondary
	Licenses when the conditions for such availability set forth in the
	Eclipse Public License v. 2.0 are satisfied: GNU General Public License,
	version 2 with the GNU Classpath Exception, which is available at
	https://www.gnu.org/software/classpath/license.html.
	
	SPDX-License-Identifier: EPL-2.0 OR GPL-2.0 WITH Classpath-exception-2.0
--><p><a id="ref-mailsessioncreate" name="ref-mailsessioncreate"></a></p>

<h4><a id="sthref34" name="sthref34"></a>Nueva Sesi&oacute;n de Jakarta Mail</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Nueva sesi&oacute;n Jakarta Mail para crear un recurso de sesi&oacute;n Jakarta Mail.</p>
<p>La p&aacute;gina Nueva sesi&oacute;n Jakarta Mail contiene las siguientes opciones.</p>
<dl>
<dt>Nombre JNDI</dt>
<dd>
<p>Nombre &uacute;nico que identifica la sesi&oacute;n de correo. Utilice el prefijo de subcontexto de nombres <code>mail/</code> para recursos de Jakarta Mail. Por ejemplo: <code>mail/MySession</code>. El nombre debe contener &uacute;nicamente caracteres alfanum&eacute;ricos, de subrayado, guiones y puntos.</p>
</dd>
<dt>Host de correo</dt>
<dd>
<p>Host del servidor de correo por defecto. Los m&eacute;todos de conexi&oacute;n de los objetos de almacenamiento y transporte utilizan este valor si no se suministra una propiedad de host espec&iacute;fica del protocolo. El nombre debe poder resolverse en un nombre de host real.</p>
</dd>
<dt>Usuario por defecto</dt>
<dd>
<p>Nombre de usuario que se debe proporcionar cuando se conecta a un servidor de correo. Los m&eacute;todos de conexi&oacute;n de los objetos de almacenamiento y transporte utilizan este valor si no se suministra una propiedad de nombre de usuario espec&iacute;fica del protocolo. El nombre de usuario debe contener &uacute;nicamente caracteres alfanum&eacute;ricos, de subrayado, guiones o puntos.</p>
</dd>
<dt>Direcci&oacute;n de remitente por defecto</dt>
<dd>
<p>Direcci&oacute;n de correo electr&oacute;nico del usuario por defecto. El formato es <i>nombre_usuario</i><code>@</code><i>host</i>.<i>dominio</i>.</p>
</dd>
<dt>Descripci&oacute;n</dt>
<dd>
<p>Descripci&oacute;n de esta sesi&oacute;n de correo.</p>
</dd>
<dt>Estado</dt>
<dd>
<p>Estado de la sesi&oacute;n de correo. La sesi&oacute;n de correo se puede activar o desactivar. El valor por defecto es Activado.</p>
</dd>
<dt>Protocolo de almacenamiento</dt>
<dd>
<p>Servicio de protocolo de almacenamiento, que se conecta con un servidor de correo, recupera mensajes y los guarda en una o varias carpetas. Los valores permitidos son <code>imap</code>, <code>pop3</code>, <code>imaps</code> y <code>pop3s</code>. El valor por defecto es <code>imap</code>.</p>
</dd>
<dt>Clase de protocolo de almacenamiento</dt>
<dd>
<p>Clase de implantaci&oacute;n del proveedor de servicios para el almacenamiento. Los valores permitidos son:</p>
<ul>
<li>
<p><code>com.sun.mail.imap.IMAPStore</code></p>
</li>
<li>
<p><code>com.sun.mail.pop3.POP3Store</code></p>
</li>
<li>
<p><code>com.sun.mail.imap.IMAPSSLStore</code></p>
</li>
<li>
<p><code>com.sun.mail.pop3.POP3SSLStore</code></p>
</li>
</ul>
<p>El valor por defecto es <code>com.sun.mail.imap.IMAPStore</code>.</p>
</dd>
<dt>Protocolo de transporte</dt>
<dd>
<p>Servicio de protocolo de transporte, que env&iacute;a mensajes. Los valores permitidos son <code>smtp</code> y <code>smtps</code>. El valor por defecto es <code>smtp</code>.</p>
</dd>
<dt>Clase de protocolo de transporte</dt>
<dd>
<p>Clase de implantaci&oacute;n del proveedor de servicios para el transporte. Los valores permitidos son:</p>
<ul>
<li>
<p><code>com.sun.mail.smtp.SMTPTransport</code></p>
</li>
<li>
<p><code>com.sun.mail.smtp.SMTPSSLTransport</code></p>
</li>
</ul>
<p>El valor por defecto es <code>com.sun.mail.smtp.SMTPTransport</code>.</p>
</dd>
<dt>Depurar</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, la depuraci&oacute;n para este recurso est&aacute; activada, Si el nivel de log de Jakarta Mail se ha definido como <code>FINE</code> o FINER, la salida de depuraci&oacute;n se genera y se incluye en el archivo log del sistema. Consulte <a href="../../../common/en/help/task-eelogginglevels.html">Para configurar niveles de log</a> para obtener m&aacute;s informaci&oacute;n sobre la definici&oacute;n del nivel de log.</p>
</dd>
<dt>Propiedades Adicionales</dt>
<dd>
<p>Propiedades adicionales de las sesiones Jakarta Mail. Para obtener una lista de las propiedades disponibles, consulte la documentaci&oacute;n de la API de Jakarta Mail (<code><a href="http://java.sun.com/products/mail/javadocs/index.html">http://java.sun.com/products/mail/javadocs/index.html</a></code>). Las propiedades adicionales deben comenzar por <code>mail-</code> y como separadores se deben utilizar guiones en lugar de puntos. Por ejemplo, <code>mail-debug</code> es correcta, pero <code>mail.debug</code> no lo es. El backend de GlassFish Server convierte los guiones en los puntos que espera la API de Jakarta Mail.</p>
</dd>
<dt>Destinos</dt>
<dd>
<p>(Esta opci&oacute;n s&oacute;lo se muestra si en el dominio se ha creado alg&uacute;n cluster o instancia independiente).</p>
<p>Clusters e instancias independientes para el recurso. Mueva los destinos seleccionados a la columna Destinos Seleccionados mediante los botones Agregar y Agregar Todos. Mueva los destinos que no necesite a la columna Destinos Disponibles mediante los botones Eliminar y Eliminar Todos.</p>
</dd>
</dl>
<a id="GHJML119" name="GHJML119"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-mailsessioncreate.html">Para crear una sesi&oacute;n Jakarta Mail</a></p>
</li>
<li>
<p><a href="task-mailsessionsedit.html">Para editar una sesi&oacute;n Jakarta Mail</a></p>
</li>
<li>
<p><a href="task-mailsessionsdelete.html">Para suprimir una sesi&oacute;n Jakarta Mail</a></p>
</li>
</ul>
<a id="GHJML120" name="GHJML120"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00035"><code>create-mail-resource</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00172"><code>list-mail-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00087"><code>delete-mail-resource</code>(1)</a></p>
</li>
</ul>


  
