<!--
 	Copyright (c) 2019 Oracle and/or its affiliates. All rights reserved.
	
	This program and the accompanying materials are made available under the
	terms of the Eclipse Public License v. 2.0, which is available at
	http://www.eclipse.org/legal/epl-2.0.
	
	This Source Code may also be made available under the following Secondary
	Licenses when the conditions for such availability set forth in the
	Eclipse Public License v. 2.0 are satisfied: GNU General Public License,
	version 2 with the GNU Classpath Exception, which is available at
	https://www.gnu.org/software/classpath/license.html.
	
	SPDX-License-Identifier: EPL-2.0 OR GPL-2.0 WITH Classpath-exception-2.0
--><p><a id="CEGEEGBB" name="CEGEEGBB"></a></p>
<!-- infolevel="all" infotype="General" -->
<h4><a id="sthref6" name="sthref6"></a>Para configurar el tiempo de ejecuci&oacute;n por lotes</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, seleccione el cluster o la instancia de servidor de GlassFish Server para el que desea ver las ejecuciones de trabajo por lotes.</p>
<p>Se abrir&aacute; la p&aacute;gina Informaci&oacute;n General.</p>
</li>
<li>
<p>Seleccione el separador Lote.</p>
<p>Se abrir&aacute; la p&aacute;gina Ejecuciones de trabajo por lotes.</p>
</li>
<li>
<p>Haga clic en el separador Configuraci&oacute;n.</p>
<p>Se abrir&aacute; la p&aacute;gina Configuraci&oacute;n de tiempo de ejecuci&oacute;n por lotes. El tiempo de ejecuci&oacute;n utiliza un servicio de ejecutor gestionado y un origen de datos para ejecutar los trabajos por lotes.</p>
</li>
<li>
<p>En la lista desplegable Nombre de la b&uacute;squeda de servicio de ejecutor, seleccione el servicio de ejecutor gestionado que desea utilizar para proporcionar threads a los trabajos por lotes.</p>
<p>El servicio de ejecutor gestionado por defecto es <code>concurrent/__defaultManagedExecutorService</code>. El servicio de ejecutor gestionado se puede cambiar una vez que el trabajo por lotes se ha ejecutado en el tiempo de ejecuci&oacute;n por lotes sin afectar a la ejecuci&oacute;n del trabajo.</p>
</li>
<li>
<p>En la lista desplegable Nombre de la b&uacute;squeda de origen de datos, seleccione el origen de datos origen que desea utilizar para almacenar informaci&oacute;n sobre el trabajo.</p>
<p>El origen de datos por defecto es <code>jdbc/__TimerPool</code>. No cambie el origen de datos despu&eacute;s de que se haya ejecutado el primer trabajo por lotes en el tiempo de ejecuci&oacute;n por lotes para su ejecuci&oacute;n. Si debe abrir el origen de datos, pare y reinicie el dominio y, a continuaci&oacute;n, realice el cambio antes de que se inicie o reinicie cualquier trabajo. Sin embargo, una vez que el origen de datos se ha cambiado, ya no se podr&aacute; acceder a la informaci&oacute;n almacenada en el origen de datos anterior.</p>
</li>
<li>
<p>Haga clic en Guardar.</p>
</li>
</ol>
<a id="sthref7" name="sthref7"></a>
<h5>Consulte tambi&eacute;n</h5>
<p><a href="tasks-topic-group002.html#CEGEIGCJ">Para ver ejecuciones de trabajo por lotes</a></p>



  